Repository: tvbeat/Recode
Catalog: i18n/*.po
Languages: ro

source: No error
ro: Nici o eroare

source: Non canonical input
ro: Intrare(input) non canonicã

source: Ambiguous output
ro: Output ambiguu

source: Untranslatable input
ro: Intrare(input) intraductibilã

source: Invalid input
ro: Input invalid

source: System detected problem
ro: Sistemul a detectat o problemã

source: Misuse of recoding library
ro: Folosire necorespunzãtoare a bibliotecii de recoding

source: Internal recoding bug
ro: Bug intern de recoding

source: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.
ro: Acest program este free software; puteþi sã-l redistribuiþi ºi/sau modificaþi sub termenii Licenþei Publice Generale GNU publicatã de Free Software Foundation; ori versiunea 2, sau (opþiunea dumneavoastrã) orice versiune ulterioarã. Acest program este distribuit în speranþa cã va fi de folos, dar FÃRÃ NICI O GARANÞIE; chiar fãrã presupusa garanþie a VANDABILITÃÞII sau MODIFICÃRII PENTRU UN SCOP PRIVAT. Citiþi Licenþa Publicã Generalã GNU pentru mai multe detalii. Ar fi trebuit sã fi primit o copie a Licenþei Publice Generale GNU împreunã cu acest program; dacã nu, scrieþi la Free Software Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.

source: Try `%s %s' for more information.
ro: Încercaþi `%s %s' pentru mai multe informaþii.

source: Free `recode' converts files between various character sets and surfaces.
ro: `recode' este free ºi converteºte fiºiere între diferite seturi de caractere ºi înfãþiºãri(surfaces).

source: Usage: %s [OPTION]... [ [CHARSET] | REQUEST [FILE]... ]
ro: Folosire: %s [OPÞIUNE]... [ [SET_CARACTERE] | CERERE [FIªIER]... ]

source: If a long option shows an argument as mandatory, then it is mandatory for the equivalent short option also. Similarly for optional arguments.
ro: Dacã o opþiune lungã afiºeazã un parametru obligatoriu, atunci este obligatoriu ºi pentru opþiunea scurtã echivalentã. Similar ºi în cazul parametrilor opþionali.

source: Listings: -l, --list[=FORMAT] list one or all known charsets and aliases -k, --known=PAIRS restrict charsets according to known PAIRS list -h, --header[=[LN/]NAME] write table NAME on stdout using LN, then exit -F, --freeze-tables write out a C module holding all tables -T, --find-subsets report all charsets being subset of others -C, --copyright display Copyright and copying conditions --help display this help and exit --version output version information and exit
ro: Listãri: -l, --list[=FORMAT] listeazã unul sau toate seturile de caractere ºi aliasurile cunoscute -k, --known=PERECHI restricþioneaza seturile de caractere potrivit listei de PERECHIcunoscute -h, --header[=[LN/]NUME] scrie tabelul NUME la stdout folosind LN, apoi terminã -F, --freeze-tables scrie un modul C ce pãstreazã toate tabelele -T, --find-subsets raporteazã toate seturile de caractere care sunt subseturi ale altora -C, --copyright afiºeazã Copyright ºi condiþii de copiere --help afiºeazã acest ajutor ºi terminã --version afiºeazã informaþii versiune ºi terminã

source: Operation modes: -v, --verbose explain sequence of steps and report progress -q, --quiet, --silent inhibit messages about irreversible recodings -f, --force force recodings even when not reversible -t, --touch touch the recoded files after replacement -i, --sequence=files use intermediate files for sequencing passes --sequence=memory use memory buffers for sequencing passes
ro: Moduri operaþie: -v, --verbose explicã secvenþa de paºi ºi raporteazã desfãºurarea -q, --quiet, --silent suprimã mesajele despre recodinguri ireversibile -f, --force forþeazã recodingurile chiar ºi când nu sunt reversibile -t, --touch efectueazã `touch' pe fiºierele recodate dupã înlocuire -i, --sequence=files foloseºte fiºiere intermediare pentru treceri secvenþiale --sequence=memory foloseºte bufferele de memorie pentru trecerile secvenþiale

source: -p, --sequence=pipe use pipe machinery for sequencing passes
ro: -p, --sequence=pipe foloseºte mecanismul de `pipe' pentru treceri secvenþiale

source: -p, --sequence=pipe same as -i (on this system)
ro: -p, --sequence=pipe la fel ca -i(pe acest system)

source: Fine tuning: -s, --strict use strict mappings, even loose characters -d, --diacritics convert only diacritics or alike for HTML/LaTeX -S, --source[=LN] limit recoding to strings and comments as for LN -c, --colons use colons instead of double quotes for diaeresis -g, --graphics approximate IBMPC rulers by ASCII graphics -x, --ignore=CHARSET ignore CHARSET while choosing a recoding path
ro: Setãri de precizie(fine tuning): -s, --strict foloseºte mapãri stricte, chiar dacã se pierd caractere -d, --diacritics converteºte doar diacritice sau asemãnãtor pentru HTML/LaTeX -S, --source[=LN] limiteazã recodinguri în ºiruri ºi comentarii ca pentru LN -c, --colons foloseºte coloane în loc de ghilimele pentru diaeresis -g, --graphics aproximeazã rigle(rulers) IBMPC prin graficã ASCII -x, --ignore=SET_CARACTERE ignorã SET_CARACTERE în alegerea cãilor de recoding

source: Option -l with no FORMAT nor CHARSET list available charsets and surfaces. FORMAT is `decimal', `octal', `hexadecimal' or `full' (or one of `dohf').
ro: Opþiunea -l fãrã FORMAT sau SET_CARACTERE listeazã seturile de caractere ºi înfãþiºãrile(surfaces) disponibile. FORMAT is `decimal', `octal', `hexadecimal' sau `full' (sau unul din `dohf').

source: Unless DEFAULT_CHARSET is set in environment, CHARSET defaults to the locale dependent encoding, determined by LC_ALL, LC_CTYPE, LANG.
ro: Dacã DEFAULT_CHARSET nu este setat în mediu (environment) CHARSET va fi encodarea specificã determinatã de LC_ALL, LC_CTYPE, LANG.

source: With -k, possible before charsets are listed for the given after CHARSET, both being tabular charsets, with PAIRS of the form `BEF1:AFT1,BEF2:AFT2,...' and BEFs and AFTs being codes are given as decimal numbers.
ro: Cu -k, seturile de caractere posibile dinainte sunt listate dupã SET_CARACTERE specificat, ambele fiind seturi de caractere tabulare, cu PERECHI de forma `BEF1:AFT1,BEF2: AFT2,...' unde BEF ºi AFT sunt coduri ce trebuie date ca numere zecimale.

source: LN is some language, it may be `c', `perl' or `po'; `c' is the default.
ro: LN e un limbaj de programare, poate fi `c', `perl' sau `po'; `c' este implicit.

source: REQUEST is SUBREQUEST[,SUBREQUEST]...; SUBREQUEST is ENCODING[..ENCODING]... ENCODING is [CHARSET][/[SURFACE]]...; REQUEST often looks like BEFORE..AFTER, with BEFORE and AFTER being charsets. An omitted CHARSET implies the usual charset; an omitted [/SURFACE]... means the implied surfaces for CHARSET; a / with an empty surface name means no surfaces at all. See the manual.
ro: CERERE(REQUEST) este SUBCERERE[,SUBCERERE]...; SUBCERERE este ENCODING[..ENCODING]... ENCODING is [SET_CARACTERE][/[ÎNFÃÞIªARE]]...; CERERE se prezintã ca PRECEDENT..ULTERIOR, cu PRECEDENT ºi ULTERIOR fiind seturi de caractere. Un SET_CARACTERE omis sugereazã setul de caractere obiºnuit; o [/ÎNFÃÞIªARE] omisã reprezintã infãþiºarea sugeratã pentru SET_CARACTERE; un / fãrã nume de înfãþiºare înseamnã fãrã înfãþiºãri. Vedeþi manualul.

source: If none of -i and -p are given, presume -p if no FILE, else -i. Each FILE is recoded over itself, destroying the original. If no FILE is specified, then act as a filter and recode stdin to stdout.
ro: Dacã nu sunt daþi nici unul dintre-i ºi -p, se presupune -p dacã nu FIªIER, altfel -i. Fiecare FIªIER este recodat(recoded) peste sine, originalul pierzându-se. Dacã nu este specificat FIªIER, atunci se comportã ca un filtru ºi recodeazã stdin în stdout.

source: Report bugs to <recode-bugs@iro.umontreal.ca>.
ro: Raportaþi bug-urile la <recode-bugs@iro.umontreal.ca>.

source: Sequence `%s' is ambiguous
ro: Secvenþa `%s' este ambiguã

source: Sequence `%s' is unknown
ro: Secvenþa `%s' nu este cunoscutã

source: Language `%s' is ambiguous
ro: Limba `%s' este ambiguã

source: Language `%s' is unknown
ro: Limba `%s' nu este cunoscutã

source: Format `%s' is ambiguous
ro: Formatul `%s' este ambiguu

source: Format `%s' is unknown
ro: Formatul `%s' nu este cunoscut

source: Written by Franc,ois Pinard <pinard@iro.umontreal.ca>.
ro: Scris de Franc,ois Pinard <pinard@iro.umontreal.ca>.

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
ro: Acesta este free software; vedeþi sursele pentur condiþiile de copiere. NU existã NICI o garanþie; nici mãcar pentru VANDABILITATE sau MODIFICARE PENTRU UN SCOP PRIVAT.

source: Symbol `%s' is unknown
ro: Simbolul `%s' nu este cunoscut

source: Charset `%s' is unknown or ambiguous
ro: Setul de caractere `%s' nu este cunoscut sau este ambiguu

source: Required argument is missing
ro: Lipseºte parametrul solicitat

source: Syntax is deprecated, please prefer `%s'
ro: Sintaxã învechitã(deprecated), utilizaþi `%s'

source: Request `%s' is erroneous
ro: Cererea `%s' este greºitã

source: Recoding %s...
ro: Recodare %s...

source: done
ro: finalizatã

source: failed: %s in step `%s..%s'
ro: eºuatã: %s în pasul `%s..%s'

source: %s failed: %s in step `%s..%s'
ro: %s a eºuat: %s în pasul `%s..%s'

source: %s in step `%s..%s'
ro: %s în pasul `%s..%s'

source: Charset %s already exists and is not %s
ro: Setul de caractere %s existã deja ºi nu este %s

source: Cannot list `%s', no names available for this charset
ro: Nu se poate lista `%s', nici un nume disponibil pentru acest set de caractere

source: Dec Oct Hex UCS2 Mne %s
ro: Zec Oct Hex UCS2 Mne %s

source: Sorry, no names available for `%s'
ro: Ne pare rãu, nici un nume disponibil pentru `%s'

source: Resurfacer set more than once for `%s'
ro: Schimbãtorul de înfãþiºãri(resurfacer) setat mai multe decât o datã pentru `%s'

source: Unsurfacer set more than once for `%s'
ro: Schimbãtorul de înfãþiºãri(unsurfacer) setat mai mult decât o datã pentru `%s'

source: Virtual memory exhausted
ro: Memorie virtualã plinã

source: Codes %3d and %3d both recode to %3d
ro: Codurile %3d ºi %3d ambele recodate în %3d

source: No character recodes to %3d
ro: Nici un caracter recodat în %3d

source: Cannot invert given one-to-one table
ro: Nu se poate inversa tabela unu la unu datã

source: Following diagnostics for `%s' to `%s'
ro: Se urmãresc diagnosticele pentru `%s' în `%s'

source: Pair no. %d: <%3d, %3d> conflicts with <%3d, %3d>
ro: Perechea numãrul %d <%3d, %3d> în conflict cu <%3d, %3d>

source: Cannot complete table from set of known pairs
ro: Nu s-a putut completa tabelul din setul de perechi cunoscute

source: Identity recoding, not worth a table
ro: Recodare de identitate, nu necesitã tabel

source: Recoding is too complex for a mere table
ro: Recodarea este prea complexã pentru un tabel simplu

source: %sConversion table generated mechanically by Free `%s' %s
ro: %sTabelul de conversie generat mecanic de `%s' Free %s

source: %sfor sequence %s.%s
ro: %s pentru secvenþa %s.%s

source: No table to print
ro: Nu existã tabel de tipãrit

source: reversible
ro: reversibil

source: %s to %s
ro: %s în %s

source: byte
ro: octet

source: variable
ro: variabil(ã)

source: *Unachievable*
ro: *Neîndeplinibil*

source: *mere copy*
ro: *copiere-simplã*

source: Virtual memory exhausted!
ro: Memorie virtualã plinã!

source: Step initialisation failed
ro: Pas de iniþializare eºuat

source: Step initialisation failed (unprocessed options)
ro: Pas de iniþializare eºuat (opþiuni neprocesate)

source: Request: %s
ro: Cerere: %s

source: Shrunk to: %s
ro: Micºorat la: %s

source: Unrecognised surface name `%s'
ro: Nume înfãþiºare necunoscut: `%s'

source: No way to recode from `%s' to `%s'
ro: Nici o ºansã de recodare din `%s' în `%s'

source: Expecting `..' in request
ro: Se aºteaptã `..' în cerere

source: Child process wait status is 0x%0.2x
ro: Starea de aºteptare a procesului derivat(child) este 0x%0.2x

source: UCS2 Mne Description
ro: UCS2 Mne Descriere
